---
kind: method
id: M:Autodesk.Revit.DB.Structure.RebarHandlePositionData.Dispose
source: html/4460aa20-2e35-e7c3-686d-97ec21a64871.htm
---
# Autodesk.Revit.DB.Structure.RebarHandlePositionData.Dispose Method

Releases all resources used by the RebarHandlePositionData

## Syntax (C#)
```csharp
public void Dispose()
```